using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ERP.Domain.Enums.TraceModule
{
    public enum TraceType
    {
        酒批订单 = 0,
        销售出库单 = 1,
        采购单 = 2,
        采购入库单 = 3,
        破损出库单 = 4,
        库存盘点单 = 5,
        合作商订单 = 6,
        退货入库单 = 7,
        采购退货单 = 8,
        物料调拨单 = 9,
        处理品转入单 = 10,
        应收单 = 11,
        收款单 = 12,
        应付单 = 13,
        付款单 = 14,
        预收单 = 15,
        预付单 = 16,
        预收退款单 = 17,
        预付退款单 = 18,
        预收应收核销 = 19,
        预付应付核销 = 20,

        供应商 = 21,
        仓库 = 22,

        城市 = 31,

        兑奖券 = 41,
        招待出库单 = 42,
        福利出库单 = 43,
        客情出库单 = 44,
        盘点单 = 45,
        兑奖入库单 = 46,

        代销售单据 = 51,

        采购申请单 = 61,

        成本调整单 = 98,
        存货核算 = 99,
    }
}
